# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
# YOLO11n Allégé - Scale n
# Ce modèle a été modifié pour être au moins 30% plus léger
# en remplaçant certains blocs lourds par des versions légères.
# Ultralytics YOLO11n Allégé - Scale n
# Ultralytics YOLO11n Allégé - Scale n
nc: 80  # nombre de classes
scale: n
scales:
  n: [0.50, 0.20, 1024]   # Réduction du multiplicateur de largeur de 0.25 à 0.20
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, GhostConv, [64, 3, 2]]
  - [-1, 1, GhostConv, [128, 3, 2]]
  - [-1, 2, C2f, [256, False, 1, 0.20]]      # e réduit à 0.20
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [-1, 2, C2f, [512, False, 1, 0.20]]      # e réduit à 0.20
  - [-1, 1, GhostConv, [512, 3, 2]]
  - [-1, 2, C2f, [512, True, 1, 0.30]]        # e réduit de 0.35 à 0.30
  - [-1, 1, GhostConv, [1024, 3, 2]]
  - [-1, 2, C2f, [1024, True, 1, 0.30]]       # e réduit à 0.30
  - [-1, 1, SPPF_light, [1024, 5]]
  - [-1, 2, C2f, [1024, False, 1, 0.30]]      # e réduit à 0.30

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2f, [512, False, 1, 0.30]]       # e réduit à 0.30
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2f, [256, False, 1, 0.30]]       # e réduit à 0.30
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C2f, [512, False, 1, 0.30]]       # e réduit à 0.30
  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C2f, [1024, True, 1, 0.30]]       # e réduit à 0.30
  - [[16, 19, 22], 1, Detect, [nc]]
